Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME70_DFP/4.2.56/same70a/include/component/usart.h
/**
 * \brief Component description for USART
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2017-08-25T14:00:00Z */
#ifndef _SAME70_USART_COMPONENT_H_
#define _SAME70_USART_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR USART                                        */
/* ************************************************************************** */

/* -------- US_CR : (USART Offset: 0x00) ( /W 32) Control Register -------- */
#define US_CR_RSTRX_Pos                       _U_(2)                                               /**< (US_CR) Reset Receiver Position */
#define US_CR_RSTRX_Msk                       (_U_(0x1) << US_CR_RSTRX_Pos)                        /**< (US_CR) Reset Receiver Mask */
#define US_CR_RSTRX(value)                    (US_CR_RSTRX_Msk & ((value) << US_CR_RSTRX_Pos))    
#define US_CR_RSTTX_Pos                       _U_(3)                                               /**< (US_CR) Reset Transmitter Position */
#define US_CR_RSTTX_Msk                       (_U_(0x1) << US_CR_RSTTX_Pos)                        /**< (US_CR) Reset Transmitter Mask */
#define US_CR_RSTTX(value)                    (US_CR_RSTTX_Msk & ((value) << US_CR_RSTTX_Pos))    
#define US_CR_RXEN_Pos                        _U_(4)                                               /**< (US_CR) Receiver Enable Position */
#define US_CR_RXEN_Msk                        (_U_(0x1) << US_CR_RXEN_Pos)                         /**< (US_CR) Receiver Enable Mask */
#define US_CR_RXEN(value)                     (US_CR_RXEN_Msk & ((value) << US_CR_RXEN_Pos))      
#define US_CR_RXDIS_Pos                       _U_(5)                                               /**< (US_CR) Receiver Disable Position */
#define US_CR_RXDIS_Msk                       (_U_(0x1) << US_CR_RXDIS_Pos)                        /**< (US_CR) Receiver Disable Mask */
#define US_CR_RXDIS(value)                    (US_CR_RXDIS_Msk & ((value) << US_CR_RXDIS_Pos))    
#define US_CR_TXEN_Pos                        _U_(6)                                               /**< (US_CR) Transmitter Enable Position */
#define US_CR_TXEN_Msk                        (_U_(0x1) << US_CR_TXEN_Pos)                         /**< (US_CR) Transmitter Enable Mask */
#define US_CR_TXEN(value)                     (US_CR_TXEN_Msk & ((value) << US_CR_TXEN_Pos))      
#define US_CR_TXDIS_Pos                       _U_(7)                                               /**< (US_CR) Transmitter Disable Position */
#define US_CR_TXDIS_Msk                       (_U_(0x1) << US_CR_TXDIS_Pos)                        /**< (US_CR) Transmitter Disable Mask */
#define US_CR_TXDIS(value)                    (US_CR_TXDIS_Msk & ((value) << US_CR_TXDIS_Pos))    
#define US_CR_RSTSTA_Pos                      _U_(8)                                               /**< (US_CR) Reset Status Bits Position */
#define US_CR_RSTSTA_Msk                      (_U_(0x1) << US_CR_RSTSTA_Pos)                       /**< (US_CR) Reset Status Bits Mask */
#define US_CR_RSTSTA(value)                   (US_CR_RSTSTA_Msk & ((value) << US_CR_RSTSTA_Pos))  
#define US_CR_STTBRK_Pos                      _U_(9)                                               /**< (US_CR) Start Break Position */
#define US_CR_STTBRK_Msk                      (_U_(0x1) << US_CR_STTBRK_Pos)                       /**< (US_CR) Start Break Mask */
#define US_CR_STTBRK(value)                   (US_CR_STTBRK_Msk & ((value) << US_CR_STTBRK_Pos))  
#define US_CR_STPBRK_Pos                      _U_(10)                                              /**< (US_CR) Stop Break Position */
#define US_CR_STPBRK_Msk                      (_U_(0x1) << US_CR_STPBRK_Pos)                       /**< (US_CR) Stop Break Mask */
#define US_CR_STPBRK(value)                   (US_CR_STPBRK_Msk & ((value) << US_CR_STPBRK_Pos))  
#define US_CR_STTTO_Pos                       _U_(11)                                              /**< (US_CR) Clear TIMEOUT Flag and Start Time-out After Next Character Received Position */
#define US_CR_STTTO_Msk                       (_U_(0x1) << US_CR_STTTO_Pos)                        /**< (US_CR) Clear TIMEOUT Flag and Start Time-out After Next Character Received Mask */
#define US_CR_STTTO(value)                    (US_CR_STTTO_Msk & ((value) << US_CR_STTTO_Pos))    
#define US_CR_SENDA_Pos                       _U_(12)                                              /**< (US_CR) Send Address Position */
#define US_CR_SENDA_Msk                       (_U_(0x1) << US_CR_SENDA_Pos)                        /**< (US_CR) Send Address Mask */
#define US_CR_SENDA(value)                    (US_CR_SENDA_Msk & ((value) << US_CR_SENDA_Pos))    
#define US_CR_RSTIT_Pos                       _U_(13)                                              /**< (US_CR) Reset Iterations Position */
#define US_CR_RSTIT_Msk                       (_U_(0x1) << US_CR_RSTIT_Pos)                        /**< (US_CR) Reset Iterations Mask */
#define US_CR_RSTIT(value)                    (US_CR_RSTIT_Msk & ((value) << US_CR_RSTIT_Pos))    
#define US_CR_RSTNACK_Pos                     _U_(14)                                              /**< (US_CR) Reset Non Acknowledge Position */
#define US_CR_RSTNACK_Msk                     (_U_(0x1) << US_CR_RSTNACK_Pos)                      /**< (US_CR) Reset Non Acknowledge Mask */
#define US_CR_RSTNACK(value)                  (US_CR_RSTNACK_Msk & ((value) << US_CR_RSTNACK_Pos))
#define US_CR_RETTO_Pos                       _U_(15)                                              /**< (US_CR) Start Time-out Immediately Position */
#define US_CR_RETTO_Msk                       (_U_(0x1) << US_CR_RETTO_Pos)                        /**< (US_CR) Start Time-out Immediately Mask */
#define US_CR_RETTO(value)                    (US_CR_RETTO_Msk & ((value) << US_CR_RETTO_Pos))    
#define US_CR_DTREN_Pos                       _U_(16)                                              /**< (US_CR) Data Terminal Ready Enable Position */
#define US_CR_DTREN_Msk                       (_U_(0x1) << US_CR_DTREN_Pos)                        /**< (US_CR) Data Terminal Ready Enable Mask */
#define US_CR_DTREN(value)                    (US_CR_DTREN_Msk & ((value) << US_CR_DTREN_Pos))    
#define US_CR_DTRDIS_Pos                      _U_(17)                                              /**< (US_CR) Data Terminal Ready Disable Position */
#define US_CR_DTRDIS_Msk                      (_U_(0x1) << US_CR_DTRDIS_Pos)                       /**< (US_CR) Data Terminal Ready Disable Mask */
#define US_CR_DTRDIS(value)                   (US_CR_DTRDIS_Msk & ((value) << US_CR_DTRDIS_Pos))  
#define US_CR_RTSEN_Pos                       _U_(18)                                              /**< (US_CR) Request to Send Pin Control Position */
#define US_CR_RTSEN_Msk                       (_U_(0x1) << US_CR_RTSEN_Pos)                        /**< (US_CR) Request to Send Pin Control Mask */
#define US_CR_RTSEN(value)                    (US_CR_RTSEN_Msk & ((value) << US_CR_RTSEN_Pos))    
#define US_CR_RTSDIS_Pos                      _U_(19)                                              /**< (US_CR) Request to Send Pin Control Position */
#define US_CR_RTSDIS_Msk                      (_U_(0x1) << US_CR_RTSDIS_Pos)                       /**< (US_CR) Request to Send Pin Control Mask */
#define US_CR_RTSDIS(value)                   (US_CR_RTSDIS_Msk & ((value) << US_CR_RTSDIS_Pos))  
#define US_CR_LINABT_Pos                      _U_(20)                                              /**< (US_CR) Abort LIN Transmission Position */
#define US_CR_LINABT_Msk                      (_U_(0x1) << US_CR_LINABT_Pos)                       /**< (US_CR) Abort LIN Transmission Mask */
#define US_CR_LINABT(value)                   (US_CR_LINABT_Msk & ((value) << US_CR_LINABT_Pos))  
#define US_CR_LINWKUP_Pos                     _U_(21)                                              /**< (US_CR) Send LIN Wakeup Signal Position */
#define US_CR_LINWKUP_Msk                     (_U_(0x1) << US_CR_LINWKUP_Pos)                      /**< (US_CR) Send LIN Wakeup Signal Mask */
#define US_CR_LINWKUP(value)                  (US_CR_LINWKUP_Msk & ((value) << US_CR_LINWKUP_Pos))
#define US_CR_Msk                             _U_(0x003FFFFC)                                      /**< (US_CR) Register Mask  */


