Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME70_DFP/4.2.56/same70a/include/component/usart.h
#define US_MR_MODE_Pos                        _U_(17)                                              /**< (US_MR Position) 9-bit Character Length */
#define US_MR_MODE_Msk                        (_U_(0x1) << US_MR_MODE_Pos)                         /**< (US_MR Mask) MODE */
#define US_MR_MODE(value)                     (US_MR_MODE_Msk & ((value) << US_MR_MODE_Pos))       

/* -------- US_IER : (USART Offset: 0x08) ( /W 32) Interrupt Enable Register -------- */
#define US_IER_RXRDY_Pos                      _U_(0)                                               /**< (US_IER) RXRDY Interrupt Enable Position */
#define US_IER_RXRDY_Msk                      (_U_(0x1) << US_IER_RXRDY_Pos)                       /**< (US_IER) RXRDY Interrupt Enable Mask */
#define US_IER_RXRDY(value)                   (US_IER_RXRDY_Msk & ((value) << US_IER_RXRDY_Pos))  
#define US_IER_TXRDY_Pos                      _U_(1)                                               /**< (US_IER) TXRDY Interrupt Enable Position */
#define US_IER_TXRDY_Msk                      (_U_(0x1) << US_IER_TXRDY_Pos)                       /**< (US_IER) TXRDY Interrupt Enable Mask */
#define US_IER_TXRDY(value)                   (US_IER_TXRDY_Msk & ((value) << US_IER_TXRDY_Pos))  
#define US_IER_RXBRK_Pos                      _U_(2)                                               /**< (US_IER) Receiver Break Interrupt Enable Position */
#define US_IER_RXBRK_Msk                      (_U_(0x1) << US_IER_RXBRK_Pos)                       /**< (US_IER) Receiver Break Interrupt Enable Mask */
#define US_IER_RXBRK(value)                   (US_IER_RXBRK_Msk & ((value) << US_IER_RXBRK_Pos))  
#define US_IER_OVRE_Pos                       _U_(5)                                               /**< (US_IER) Overrun Error Interrupt Enable Position */
#define US_IER_OVRE_Msk                       (_U_(0x1) << US_IER_OVRE_Pos)                        /**< (US_IER) Overrun Error Interrupt Enable Mask */
#define US_IER_OVRE(value)                    (US_IER_OVRE_Msk & ((value) << US_IER_OVRE_Pos))    
#define US_IER_FRAME_Pos                      _U_(6)                                               /**< (US_IER) Framing Error Interrupt Enable Position */
#define US_IER_FRAME_Msk                      (_U_(0x1) << US_IER_FRAME_Pos)                       /**< (US_IER) Framing Error Interrupt Enable Mask */
#define US_IER_FRAME(value)                   (US_IER_FRAME_Msk & ((value) << US_IER_FRAME_Pos))  
#define US_IER_PARE_Pos                       _U_(7)                                               /**< (US_IER) Parity Error Interrupt Enable Position */
#define US_IER_PARE_Msk                       (_U_(0x1) << US_IER_PARE_Pos)                        /**< (US_IER) Parity Error Interrupt Enable Mask */
#define US_IER_PARE(value)                    (US_IER_PARE_Msk & ((value) << US_IER_PARE_Pos))    
#define US_IER_TIMEOUT_Pos                    _U_(8)                                               /**< (US_IER) Time-out Interrupt Enable Position */
#define US_IER_TIMEOUT_Msk                    (_U_(0x1) << US_IER_TIMEOUT_Pos)                     /**< (US_IER) Time-out Interrupt Enable Mask */
#define US_IER_TIMEOUT(value)                 (US_IER_TIMEOUT_Msk & ((value) << US_IER_TIMEOUT_Pos))
#define US_IER_TXEMPTY_Pos                    _U_(9)                                               /**< (US_IER) TXEMPTY Interrupt Enable Position */
#define US_IER_TXEMPTY_Msk                    (_U_(0x1) << US_IER_TXEMPTY_Pos)                     /**< (US_IER) TXEMPTY Interrupt Enable Mask */
#define US_IER_TXEMPTY(value)                 (US_IER_TXEMPTY_Msk & ((value) << US_IER_TXEMPTY_Pos))
#define US_IER_ITER_Pos                       _U_(10)                                              /**< (US_IER) Max number of Repetitions Reached Interrupt Enable Position */
#define US_IER_ITER_Msk                       (_U_(0x1) << US_IER_ITER_Pos)                        /**< (US_IER) Max number of Repetitions Reached Interrupt Enable Mask */
#define US_IER_ITER(value)                    (US_IER_ITER_Msk & ((value) << US_IER_ITER_Pos))    
#define US_IER_NACK_Pos                       _U_(13)                                              /**< (US_IER) Non Acknowledge Interrupt Enable Position */
#define US_IER_NACK_Msk                       (_U_(0x1) << US_IER_NACK_Pos)                        /**< (US_IER) Non Acknowledge Interrupt Enable Mask */
#define US_IER_NACK(value)                    (US_IER_NACK_Msk & ((value) << US_IER_NACK_Pos))    
#define US_IER_RIIC_Pos                       _U_(16)                                              /**< (US_IER) Ring Indicator Input Change Enable Position */
#define US_IER_RIIC_Msk                       (_U_(0x1) << US_IER_RIIC_Pos)                        /**< (US_IER) Ring Indicator Input Change Enable Mask */
#define US_IER_RIIC(value)                    (US_IER_RIIC_Msk & ((value) << US_IER_RIIC_Pos))    
#define US_IER_DSRIC_Pos                      _U_(17)                                              /**< (US_IER) Data Set Ready Input Change Enable Position */
#define US_IER_DSRIC_Msk                      (_U_(0x1) << US_IER_DSRIC_Pos)                       /**< (US_IER) Data Set Ready Input Change Enable Mask */
#define US_IER_DSRIC(value)                   (US_IER_DSRIC_Msk & ((value) << US_IER_DSRIC_Pos))  
#define US_IER_DCDIC_Pos                      _U_(18)                                              /**< (US_IER) Data Carrier Detect Input Change Interrupt Enable Position */
#define US_IER_DCDIC_Msk                      (_U_(0x1) << US_IER_DCDIC_Pos)                       /**< (US_IER) Data Carrier Detect Input Change Interrupt Enable Mask */
#define US_IER_DCDIC(value)                   (US_IER_DCDIC_Msk & ((value) << US_IER_DCDIC_Pos))  
#define US_IER_CTSIC_Pos                      _U_(19)                                              /**< (US_IER) Clear to Send Input Change Interrupt Enable Position */
#define US_IER_CTSIC_Msk                      (_U_(0x1) << US_IER_CTSIC_Pos)                       /**< (US_IER) Clear to Send Input Change Interrupt Enable Mask */
#define US_IER_CTSIC(value)                   (US_IER_CTSIC_Msk & ((value) << US_IER_CTSIC_Pos))  
#define US_IER_MANE_Pos                       _U_(24)                                              /**< (US_IER) Manchester Error Interrupt Enable Position */
#define US_IER_MANE_Msk                       (_U_(0x1) << US_IER_MANE_Pos)                        /**< (US_IER) Manchester Error Interrupt Enable Mask */
#define US_IER_MANE(value)                    (US_IER_MANE_Msk & ((value) << US_IER_MANE_Pos))    
#define US_IER_Msk                            _U_(0x010F27E7)                                      /**< (US_IER) Register Mask  */


